Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/occupational_injuries_benefit_overview.html.txt.tmx
Source language: en
Languages: ga

source: Occupational Injuries Scheme - Introduction
ga: Scéim na Sochair Gortuithe Ceirde - Ginearálta

source: The Occupational Injuries Scheme provides benefits for people injured or incapacitated by an accident at work or while travelling directly to or from work. The scheme also covers people who have contracted a disease as a result of the type of work they do. There are a number of benefits available and there are different conditions attached to each benefit
ga: Tá scéim liúntais ag an Roinn Coimirce Sóisialaí le haghaidh daoine a gortaíodh nó atá faoi mhíchumas de bhárr timpiste ag obair nó fad is a bhí siad ag taisteal chuig / ón obair nó de bharr go bhfuaireadar galar mar gheall ar an gcineál oibre a bhíonn ar bun acu

source: • Widow's, Widower's or Surviving Civil Partner's Pension (paid at a higher rate than the ordinary Contributory Widow's, Widower's or Surviving Civil Partner's Pension)
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (iníoctha ag ráta níos airde ná an gnáth Phinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh)

source: Injury Benefit is a weekly payment if you are unfit for work due to the accident or disease. Payment is normally made from the 7th day of incapacity for work
ga: Séard é Sochar Gortuithe Ceirde ná sochar a íocfar leat in aghaidh na seachtaine mura bhfuil tú i riocht dul ag obair de bhárr gortuithe nó galair

source: Injury Benefit can be paid for up to 26 weeks from the date of your accident or development of the disease (not the date you apply)
ga: Is féidir é a íoc ar feadh suas le 26 seachtaine ón dáta ar tharla an timpiste nó a bhfuair tú an galar ( ní ón dáta ar chuir tú d'iarratas isteach)

source: If the accident or disease caused you to lose physical or mental ability you should apply for Disablement Benefit before your Injury Benefit ceases. If you are still unfit for work after 26 weeks you may apply for Illness Benefit or Disability Allowance
ga: Sula dtagann deireadh leis an íocaíocht ar Shochar Díobhála ba cheart duit éileamh a dhéanamh ar Shochar Míthreorach mas rud é gur chaill tú cumas de bharr do thimpiste nó do ghalair

source: Disablement Benefit is paid if you have a loss of physical or mental faculty after the accident or disease
ga: Íoctar, Sochar Buanmhíchumais chailleann tú úsáid cumais fhisiciúil nó mheabhrach de bharr timpiste i mbun oibre, nó de bhárr galar ceirde

source: You do not have to be unfit for work
ga: D'fhéadfadh go mbeadh ar do chumas dul ag obair díreach tar éis na timpiste

source: If you are fit for work immediately after the accident you should apply within 3 months of the injury or onset of the disease
ga: Má tá, ba cheart duit iarratas a chur isteach taobh istigh de thrí mhí ón am ar tharla an timpiste nó ar thosaigh an galar

source: You must have a medical assessment to determine the degree of loss of faculty and the rate of benefit is based on this
ga: Caithfidh tú dul faoi scrúdú dochtúra chun méid an chumais atá caillte agat a mheas. Bunófar ráta an sochair ar an scrúdú

source: (Civil servants insured at Class B are not eligible for Disablement Benefit for the first 26 weeks after the date of the accident
ga: (Níl Stát Sheirbhísí atá ag íoc árachais in Acme B, i dteideal Sochair Míchumais ar feadh na céad 26 seachtaine tar éis dáta na timpiste

source: Half-rate benefit only is payable after this period.) Disablement Benefit can be paid as a lump sum (called Disablement Gratuity) or as a weekly payment (called Disablement Pension)
ga: Tar éis na tréimhse seo, ní íocfar an liúntas ach ag leath an ráta.)

source: Incapacity Supplement is a weekly supplement, which may be paid if you are not eligible for Illness Benefit or another social welfare payment
ga: Fórlionadh Neamhábaltachta seo fordheontas a d'fhéadfaí a íoc leat in aghaidh na seachtaine más rud é nach bhfuil tú i dteideal Sochar Míchumas

source: To get the supplement you must be getting Disablement Pension and be permanently incapable of work
ga: Caithfidh tú a bheith ar Shochar Míchumasaíochta agus gan a bheith i riocht dul i mbun oibre go deo

source: Constant Attendance Allowance is a weekly allowance, which you may be paid if you are getting Disablement Benefit and are so seriously disabled as to need someone to help you daily at home to attend to your personal needs
ga: Liúntas Síor-Aire Seo liúntas a íoctar in aghaidh na seachtaine más rud é go bhfuil tú chomh mór faoi mhí-chumas is go mbíonn duine uait gach aon lá, sa bhaile, chun aire a thabhairt duit

source: If you incur medical costs as a result of your occupational injury or disease, you can claim for the cost of certain expenses which are not already covered by the Health Service Executive (HSE) or through the Treatment Benefit Scheme under the Medical Care Scheme
ga: Scéim Cúraim Sláinte Má bhíonn costaisí sláinte ort de bharr timpiste nó galar ceirde, is féidir leat éileamh a dhéanamh ar chostais áirithe nach bhfuil clúdaithe cheana féin ag an Fheidhmeannacht na Seirbhíse Sláinte (FSS), ná ag an Scéim Liúntas Córaíochta (leighis) faoi an Scéim Chúram Leighis

source: The cost of private or semi-private accommodation and treatment can not be recouped under the Occupational Injuries Scheme
ga: Ní féidir an costas a bhain le cóireáil nó le costaísí ospidéil phriobháideacha nó leath-phriobháideach a fháil arais faoin scéim Gortuithe Ceirde

source: In general people in employment insurable at PRSI Class A, D, J or M are covered in full for Occupational Injuries Benefits
ga: I gcoitinne, tá daoine fostaithe, atá ag íoc Aicme A,D,J nó M de P.C.Á.S, clúdaithe go hiomlán le haghaidh Sochair Gortuithe Ceirde

source: Civil servants recruited prior to April 1995 and insured at Class B may only qualify for limited Occupational Injuries Benefits
ga: D'fhéadfadh sé nach mbeadh Stát Sheirbhísí a fostaíodh roimh 1995 agus atá ag íoc P.C.Á.S faoi Aicme B, i dteideal ach Sochar Teoranta Gortuithe Ceirde

source: Education and Training Board trainees, people on employment schemes and people over 66 who are working are covered for Occupational Injuries Benefits
ga: Tá foghlaimeoirí de chuid SOLAS, daoine ar scéimeanna SOLAS agus daoine ós cionn 66 atá ag obair, clúdaithe le haghaidh Sochair Gortuithe Ceirde

source: Unlike other social insurance benefits, it is not necessary to have a set number of PRSI contributions to qualify
ga: Ní hionann agus sochair árachais shóisialta eile, ní gá go mbeadh uimhir áirithe síntiúis P.C.Á.S ag duine chun a bheith ina theideal

source: It is simply necessary to be in employment that is insurable for Occupational Injuries
ga: Sé/sí an fostóir seachas an fostaí a íocann na síntiúis don Chiste Gortuithe Ceirde

source: Civil law claims for damages
ga: Éileamh a dhéanamh ar dhamáiste faoin Dlí Sibhialta

source: The Recovery of Certain Benefits and Assistance (RBA) Scheme enables the Department of Social Protection to recover the value of certain illness-related social welfare payments as a consequence of personal injuries claims
ga: Má tá íocaíochtaí Gortuithe Ceirde fáighte agat ní chiallaíonn sé seo ann féin, go bhfaighidh tú cúiteamh. Nuair a bheidh an chúirt shiabhialta ag déanamh measúnaithe ar an damáiste cuirfidh sí san áireamh aon Sochar Gortuithe, Sochar Mí-chumais nó Deontas Báis atá íoctha leat

source: They are recovered from the compensator and not from the injured person
ga: Ní chuirfear íocaíochtaí Leasa Shóisialaigh eile san áireamh

source: Read more about the scheme
ga: Cá háit a dheánfaidh mé iarratas?
